programs = ["Экономика", "Бизнес-информатика", "Туризм"]
subjects = [
    "Эконометрика",
    "Базы данных",
    "Теория игр",
    "Программирование на Python"
]
olympiads = [
    'олимпиада 1',
    'олимпиада 2',
    'олимпиада 3',
    'олимпиада 4',
]

subject_dict = {
    "Эконометрика": """
        наука, изучающая количественные и качественные экономические
        взаимосвязи с помощью статистических и других математических
        методов и моделей.""",
    "Базы данных":
        """упорядоченный набор структурированной информации
        или данных, которые обычно хранятся в электронном виде
        в компьютерной системе.""",
    "Теория игр":
        """математический метод изучения оптимальных стратегий
        в играх.""",
    "Программирование на Python":
        """высокоуровневый язык программирования общего назначения,
        который используется в том числе и для разработки веб-приложений."""
}

olympiad_dict = {
    "олимпиада 1": """
        описание олимпиады 1""",
    "олимпиада 2":
        """описание олимпиады 2
        описание олимпиады 2""",
    "олимпиада 3":
        """описание олимпиады 3
        описание олимпиады 3
        описание олимпиады 3""",
    "олимпиада 4":
        """описание олимпиады 4
        описание олимпиады 4
        описание олимпиады 4
        описание олимпиады 4"""
}
